app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "new comment"], ["post_id", 12], ["created_at", "2018-05-24 02:59:06.771498"], ["updated_at", "2018-05-24 02:59:06.771498"]]
---
  def create
      @post = Post.find(params[:post_id])
      @post.comments.create(commment_params)