app/controllers/posts_controller.rb

    def index
    @posts = Post.all.order(created_at: 'desc')
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

    def create
         #render plain: params[:post].inspect
         #save
         @post = Post.new(post_params)
         if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "b"], ["created_at", "2018-05-23 13:14:30.174444"], ["updated_at", "2018-05-23 13:14:30.174444"]]

    def update
      @post = Post.find(params[:id])
      if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "new post2"], ["body", "new post body2"], ["updated_at", "2018-05-23 15:01:33.759873"], ["id", 14]]